codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128h.h
extern volatile __U1STAbits_t U1STAbits __asm__ ("U1STA") __attribute__((section("sfrs")));
extern volatile unsigned int        U1ASTACLR __attribute__((section("sfrs")));
extern volatile unsigned int        U1STACLR __attribute__((section("sfrs")));
extern volatile unsigned int        U1ASTASET __attribute__((section("sfrs")));
extern volatile unsigned int        U1STASET __attribute__((section("sfrs")));
extern volatile unsigned int        U1ASTAINV __attribute__((section("sfrs")));
extern volatile unsigned int        U1STAINV __attribute__((section("sfrs")));
extern volatile unsigned int        U1ATXREG __attribute__((section("sfrs")));
extern volatile unsigned int        U1TXREG __attribute__((section("sfrs")));
extern volatile unsigned int        U1ARXREG __attribute__((section("sfrs")));
extern volatile unsigned int        U1RXREG __attribute__((section("sfrs")));
extern volatile unsigned int        U1ABRG __attribute__((section("sfrs")));
extern volatile unsigned int        U1BRG __attribute__((section("sfrs")));
extern volatile unsigned int        U1ABRGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        U1BRGCLR __attribute__((section("sfrs")));
extern volatile unsigned int        U1ABRGSET __attribute__((section("sfrs")));
extern volatile unsigned int        U1BRGSET __attribute__((section("sfrs")));
extern volatile unsigned int        U1ABRGINV __attribute__((section("sfrs")));
extern volatile unsigned int        U1BRGINV __attribute__((section("sfrs")));
extern volatile unsigned int        AFECON __attribute__((section("sfrs")));
typedef struct {
  unsigned REGEN:1;
  unsigned VMIDEN:1;
  unsigned VDDO2EN:1;
  unsigned :5;
  unsigned REFSEL:2;
  unsigned :3;
  unsigned SIDL:1;
  unsigned FRZ:1;
  unsigned ON:1;
  unsigned GTXEN:2;
  unsigned :2;
  unsigned GTXPRE:2;
  unsigned :2;
  unsigned GTXSLEN:2;
} __AFECONbits_t;
extern volatile __AFECONbits_t AFECONbits __asm__ ("AFECON") __attribute__((section("sfrs")));
extern volatile unsigned int        AFECONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        AFECONSET __attribute__((section("sfrs")));
extern volatile unsigned int        AFECONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0B __attribute__((section("sfrs")));
typedef struct {
  unsigned :16;
  unsigned TX0_0:1;
  unsigned TX1_0:1;
  unsigned TX2_0:1;
  unsigned TX3_0:1;
  unsigned TX4_0:1;
  unsigned TX0_1:1;
  unsigned TX1_1:1;
  unsigned TX2_1:1;
  unsigned TX3_1:1;
  unsigned TX4_1:1;
  unsigned TX0_2:1;
  unsigned TX1_2:1;
  unsigned TX2_2:1;
  unsigned TX3_2:1;
  unsigned TX4_2:1;
  unsigned TX0_3:1;
} __CVDTXEN0Bbits_t;
extern volatile __CVDTXEN0Bbits_t CVDTXEN0Bbits __asm__ ("CVDTXEN0B") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN0BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1B __attribute__((section("sfrs")));
typedef struct {
  unsigned TX1_3:1;
  unsigned TX2_3:1;
  unsigned TX3_3:1;
  unsigned TX4_3:1;
  unsigned TX0_4:1;
  unsigned TX1_4:1;
  unsigned TX2_4:1;
  unsigned TX3_4:1;
  unsigned TX4_4:1;
  unsigned TX0_5:1;
  unsigned TX1_5:1;
  unsigned TX2_5:1;
  unsigned TX3_5:1;
  unsigned TX4_5:1;
  unsigned TX0_6:1;
  unsigned TX1_6:1;
  unsigned TX2_6:1;
  unsigned TX3_6:1;
  unsigned TX4_6:1;
  unsigned TX0_7:1;
  unsigned TX1_7:1;
  unsigned TX2_7:1;
  unsigned TX3_7:1;
  unsigned TX4_7:1;
  unsigned TX0_8:1;
  unsigned TX1_8:1;
  unsigned TX2_8:1;
  unsigned TX3_8:1;
  unsigned TX4_8:1;
  unsigned TX0_9:1;
  unsigned TX1_9:1;
  unsigned TX2_9:1;
} __CVDTXEN1Bbits_t;
extern volatile __CVDTXEN1Bbits_t CVDTXEN1Bbits __asm__ ("CVDTXEN1B") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDTXEN1BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0B __attribute__((section("sfrs")));
typedef struct {
  unsigned RX0_0:1;
  unsigned RX1_0:1;
  unsigned RX2_0:1;
  unsigned RX3_0:1;
  unsigned RX4_0:1;
  unsigned RX0_1:1;
  unsigned RX1_1:1;
  unsigned RX2_1:1;
  unsigned RX3_1:1;
  unsigned RX4_1:1;
  unsigned RX0_2:1;
  unsigned RX1_2:1;
  unsigned RX2_2:1;
  unsigned RX3_2:1;
  unsigned RX4_2:1;
  unsigned RX0_3:1;
  unsigned RX1_3:1;
  unsigned RX2_3:1;
  unsigned RX3_3:1;
  unsigned RX4_3:1;
  unsigned RX0_4:1;
  unsigned RX1_4:1;
  unsigned RX2_4:1;
  unsigned RX3_4:1;
  unsigned RX4_4:1;
  unsigned RX0_5:1;
  unsigned RX1_5:1;
  unsigned RX2_5:1;
  unsigned RX3_5:1;
  unsigned RX4_5:1;
  unsigned RX0_6:1;
  unsigned RX1_6:1;
} __CVDRXEN0Bbits_t;
extern volatile __CVDRXEN0Bbits_t CVDRXEN0Bbits __asm__ ("CVDRXEN0B") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN0BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1B __attribute__((section("sfrs")));
typedef struct {
  unsigned RX2_6:1;
  unsigned RX3_6:1;
  unsigned RX4_6:1;
  unsigned RX0_7:1;
  unsigned RX1_7:1;
  unsigned RX2_7:1;
  unsigned RX3_7:1;
  unsigned RX4_7:1;
  unsigned RX0_8:1;
  unsigned RX1_8:1;
  unsigned RX2_8:1;
  unsigned RX3_8:1;
  unsigned RX4_8:1;
  unsigned RX0_9:1;
  unsigned RX1_9:1;
  unsigned RX2_9:1;
  unsigned RX3_9:1;
  unsigned RX4_9:1;
  unsigned RX0_10:1;
  unsigned RX1_10:1;
  unsigned RX2_10:1;
  unsigned RX3_10:1;
  unsigned RX4_10:1;
} __CVDRXEN1Bbits_t;
extern volatile __CVDRXEN1Bbits_t CVDRXEN1Bbits __asm__ ("CVDRXEN1B") __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CVDRXEN1BINV __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0B __attribute__((section("sfrs")));
typedef struct {
  unsigned REFCON0:8;
  unsigned REFCON1:8;
  unsigned REFCON2:8;
  unsigned REFGAIN3:8;
} __REFCON0Bbits_t;
extern volatile __REFCON0Bbits_t REFCON0Bbits __asm__ ("REFCON0B") __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0BSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON0BINV __attribute__((section("sfrs")));
extern volatile unsigned int        REFCON1B __attribute__((section("sfrs")));
typedef struct {
  unsigned REFGAIN4:8;
} __REFCON1Bbits_t;
