codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128h.h
extern volatile __FISSTAT1bits_t FISSTAT1bits __asm__ ("FISSTAT1") __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT1SET __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT1INV __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT2 __attribute__((section("sfrs")));
typedef struct {
  unsigned LFIS2:12;
  unsigned :4;
  unsigned HFIS2:12;
} __FISSTAT2bits_t;
extern volatile __FISSTAT2bits_t FISSTAT2bits __asm__ ("FISSTAT2") __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT2SET __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT2INV __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT3 __attribute__((section("sfrs")));
typedef struct {
  unsigned LFIS3:12;
  unsigned :4;
  unsigned HFIS3:12;
} __FISSTAT3bits_t;
extern volatile __FISSTAT3bits_t FISSTAT3bits __asm__ ("FISSTAT3") __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT3SET __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT3INV __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT4 __attribute__((section("sfrs")));
typedef struct {
  unsigned LFIS4:12;
  unsigned :4;
  unsigned HFIS4:12;
} __FISSTAT4bits_t;
extern volatile __FISSTAT4bits_t FISSTAT4bits __asm__ ("FISSTAT4") __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT4SET __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT4INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT0 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICCOUNT0:32;
} __CICOUT0bits_t;
extern volatile __CICOUT0bits_t CICOUT0bits __asm__ ("CICOUT0") __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT0SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT0INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT1 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICCOUNT1:32;
} __CICOUT1bits_t;
extern volatile __CICOUT1bits_t CICOUT1bits __asm__ ("CICOUT1") __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT1SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT1INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT2 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICCOUNT2:32;
} __CICOUT2bits_t;
extern volatile __CICOUT2bits_t CICOUT2bits __asm__ ("CICOUT2") __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT2SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT2INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT3 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICCOUNT3:32;
} __CICOUT3bits_t;
extern volatile __CICOUT3bits_t CICOUT3bits __asm__ ("CICOUT3") __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT3SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT3INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT4 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICCOUNT4:32;
} __CICOUT4bits_t;
extern volatile __CICOUT4bits_t CICOUT4bits __asm__ ("CICOUT4") __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT4SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICOUT4INV __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned OSWEN:1;
    unsigned SOSCEN:1;
    unsigned UFRCEN:1;
    unsigned CF:1;
    unsigned SLPEN:1;
    unsigned SLOCK:1;
    unsigned ULOCK:1;
    unsigned CLKLOCK:1;
    unsigned NOSC:3;
    unsigned :1;
    unsigned COSC:3;
    unsigned :1;
    unsigned PLLMULT:3;
    unsigned PBDIV:2;
    unsigned PBDIVRDY:1;
    unsigned SOSCRDY:1;
    unsigned :1;
    unsigned FRCDIV:3;
    unsigned PLLODIV:3;
  };
  struct {
    unsigned :8;
    unsigned NOSC0:1;
    unsigned NOSC1:1;
    unsigned NOSC2:1;
    unsigned :1;
    unsigned COSC0:1;
    unsigned COSC1:1;
    unsigned COSC2:1;
    unsigned :1;
    unsigned PLLMULT0:1;
    unsigned PLLMULT1:1;
    unsigned PLLMULT2:1;
    unsigned PBDIV0:1;
    unsigned PBDIV1:1;
    unsigned :3;
    unsigned FRCDIV0:1;
    unsigned FRCDIV1:1;
    unsigned FRCDIV2:1;
    unsigned PLLODIV0:1;
    unsigned PLLODIV1:1;
    unsigned PLLODIV2:1;
  };
  struct {
    unsigned w:32;
  };
} __OSCCONbits_t;
extern volatile __OSCCONbits_t OSCCONbits __asm__ ("OSCCON") __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        OSCCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUN __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TUN:6;
  };
  struct {
    unsigned TUN0:1;
    unsigned TUN1:1;
    unsigned TUN2:1;
    unsigned TUN3:1;
    unsigned TUN4:1;
    unsigned TUN5:1;
  };
  struct {
    unsigned w:32;
  };
} __OSCTUNbits_t;
extern volatile __OSCTUNbits_t OSCTUNbits __asm__ ("OSCTUN") __attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUNCLR __attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUNSET __attribute__((section("sfrs")));
extern volatile unsigned int        OSCTUNINV __attribute__((section("sfrs")));
extern volatile unsigned int        REFOCON __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ROSEL:4;
    unsigned :4;
    unsigned ACTIVE:1;
    unsigned DIVSWEN:1;
    unsigned :1;
    unsigned RSLP:1;
    unsigned OE:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned RODIV:15;
  };
  struct {
    unsigned w:32;
  };
} __REFOCONbits_t;
extern volatile __REFOCONbits_t REFOCONbits __asm__ ("REFOCON") __attribute__((section("sfrs")));
extern volatile unsigned int        REFOCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFOCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFOCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        REFOTRIM __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :23;
    unsigned ROTRIM:9;
  };
  struct {
    unsigned w:32;
  };
} __REFOTRIMbits_t;
extern volatile __REFOTRIMbits_t REFOTRIMbits __asm__ ("REFOTRIM") __attribute__((section("sfrs")));
extern volatile unsigned int        REFOTRIMCLR __attribute__((section("sfrs")));
extern volatile unsigned int        REFOTRIMSET __attribute__((section("sfrs")));
extern volatile unsigned int        REFOTRIMINV __attribute__((section("sfrs")));
extern volatile unsigned int        CFGCON __attribute__((section("sfrs")));
typedef struct {
  unsigned TDOEN:1;
  unsigned FAEN:1;
  unsigned TROEN:1;
  unsigned JTAGEN:1;
  unsigned :4;
  unsigned RPFA:1;
  unsigned UXDIAG:1;
  unsigned :2;
  unsigned PMDLOCK:1;
  unsigned IOLOCK:1;
  unsigned :17;
  unsigned TSTCLM:1;
} __CFGCONbits_t;
extern volatile __CFGCONbits_t CFGCONbits __asm__ ("CFGCON") __attribute__((section("sfrs")));
extern volatile unsigned int        DDPCON __attribute__((section("sfrs")));
typedef struct {
  unsigned TDOEN:1;
  unsigned FAEN:1;
  unsigned TROEN:1;
  unsigned JTAGEN:1;
  unsigned :4;
  unsigned RPFA:1;
  unsigned UXDIAG:1;
  unsigned :2;
  unsigned PMDLOCK:1;
  unsigned IOLOCK:1;
  unsigned :17;
  unsigned TSTCLM:1;
} __DDPCONbits_t;
