codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128h.h
#define _CVDTXEN1B_TX0_4_POSITION                0x00000004
#define _CVDTXEN1B_TX0_4_MASK                    0x00000010
#define _CVDTXEN1B_TX0_4_LENGTH                  0x00000001

#define _CVDTXEN1B_TX1_4_POSITION                0x00000005
#define _CVDTXEN1B_TX1_4_MASK                    0x00000020
#define _CVDTXEN1B_TX1_4_LENGTH                  0x00000001

#define _CVDTXEN1B_TX2_4_POSITION                0x00000006
#define _CVDTXEN1B_TX2_4_MASK                    0x00000040
#define _CVDTXEN1B_TX2_4_LENGTH                  0x00000001

#define _CVDTXEN1B_TX3_4_POSITION                0x00000007
#define _CVDTXEN1B_TX3_4_MASK                    0x00000080
#define _CVDTXEN1B_TX3_4_LENGTH                  0x00000001

#define _CVDTXEN1B_TX4_4_POSITION                0x00000008
#define _CVDTXEN1B_TX4_4_MASK                    0x00000100
#define _CVDTXEN1B_TX4_4_LENGTH                  0x00000001

#define _CVDTXEN1B_TX0_5_POSITION                0x00000009
#define _CVDTXEN1B_TX0_5_MASK                    0x00000200
#define _CVDTXEN1B_TX0_5_LENGTH                  0x00000001

#define _CVDTXEN1B_TX1_5_POSITION                0x0000000A
#define _CVDTXEN1B_TX1_5_MASK                    0x00000400
#define _CVDTXEN1B_TX1_5_LENGTH                  0x00000001

#define _CVDTXEN1B_TX2_5_POSITION                0x0000000B
#define _CVDTXEN1B_TX2_5_MASK                    0x00000800
#define _CVDTXEN1B_TX2_5_LENGTH                  0x00000001

#define _CVDTXEN1B_TX3_5_POSITION                0x0000000C
#define _CVDTXEN1B_TX3_5_MASK                    0x00001000
#define _CVDTXEN1B_TX3_5_LENGTH                  0x00000001

#define _CVDTXEN1B_TX4_5_POSITION                0x0000000D
#define _CVDTXEN1B_TX4_5_MASK                    0x00002000
#define _CVDTXEN1B_TX4_5_LENGTH                  0x00000001

#define _CVDTXEN1B_TX0_6_POSITION                0x0000000E
#define _CVDTXEN1B_TX0_6_MASK                    0x00004000
#define _CVDTXEN1B_TX0_6_LENGTH                  0x00000001

#define _CVDTXEN1B_TX1_6_POSITION                0x0000000F
#define _CVDTXEN1B_TX1_6_MASK                    0x00008000
#define _CVDTXEN1B_TX1_6_LENGTH                  0x00000001

#define _CVDTXEN1B_TX2_6_POSITION                0x00000010
#define _CVDTXEN1B_TX2_6_MASK                    0x00010000
#define _CVDTXEN1B_TX2_6_LENGTH                  0x00000001

#define _CVDTXEN1B_TX3_6_POSITION                0x00000011
#define _CVDTXEN1B_TX3_6_MASK                    0x00020000
#define _CVDTXEN1B_TX3_6_LENGTH                  0x00000001

#define _CVDTXEN1B_TX4_6_POSITION                0x00000012
#define _CVDTXEN1B_TX4_6_MASK                    0x00040000
#define _CVDTXEN1B_TX4_6_LENGTH                  0x00000001

#define _CVDTXEN1B_TX0_7_POSITION                0x00000013
#define _CVDTXEN1B_TX0_7_MASK                    0x00080000
#define _CVDTXEN1B_TX0_7_LENGTH                  0x00000001

#define _CVDTXEN1B_TX1_7_POSITION                0x00000014
#define _CVDTXEN1B_TX1_7_MASK                    0x00100000
#define _CVDTXEN1B_TX1_7_LENGTH                  0x00000001

#define _CVDTXEN1B_TX2_7_POSITION                0x00000015
#define _CVDTXEN1B_TX2_7_MASK                    0x00200000
#define _CVDTXEN1B_TX2_7_LENGTH                  0x00000001

#define _CVDTXEN1B_TX3_7_POSITION                0x00000016
#define _CVDTXEN1B_TX3_7_MASK                    0x00400000
#define _CVDTXEN1B_TX3_7_LENGTH                  0x00000001

#define _CVDTXEN1B_TX4_7_POSITION                0x00000017
#define _CVDTXEN1B_TX4_7_MASK                    0x00800000
#define _CVDTXEN1B_TX4_7_LENGTH                  0x00000001

#define _CVDTXEN1B_TX0_8_POSITION                0x00000018
#define _CVDTXEN1B_TX0_8_MASK                    0x01000000
#define _CVDTXEN1B_TX0_8_LENGTH                  0x00000001

#define _CVDTXEN1B_TX1_8_POSITION                0x00000019
#define _CVDTXEN1B_TX1_8_MASK                    0x02000000
#define _CVDTXEN1B_TX1_8_LENGTH                  0x00000001

#define _CVDTXEN1B_TX2_8_POSITION                0x0000001A
#define _CVDTXEN1B_TX2_8_MASK                    0x04000000
#define _CVDTXEN1B_TX2_8_LENGTH                  0x00000001

#define _CVDTXEN1B_TX3_8_POSITION                0x0000001B
#define _CVDTXEN1B_TX3_8_MASK                    0x08000000
#define _CVDTXEN1B_TX3_8_LENGTH                  0x00000001

#define _CVDTXEN1B_TX4_8_POSITION                0x0000001C
#define _CVDTXEN1B_TX4_8_MASK                    0x10000000
#define _CVDTXEN1B_TX4_8_LENGTH                  0x00000001

#define _CVDTXEN1B_TX0_9_POSITION                0x0000001D
#define _CVDTXEN1B_TX0_9_MASK                    0x20000000
#define _CVDTXEN1B_TX0_9_LENGTH                  0x00000001

#define _CVDTXEN1B_TX1_9_POSITION                0x0000001E
#define _CVDTXEN1B_TX1_9_MASK                    0x40000000
#define _CVDTXEN1B_TX1_9_LENGTH                  0x00000001

#define _CVDTXEN1B_TX2_9_POSITION                0x0000001F
#define _CVDTXEN1B_TX2_9_MASK                    0x80000000
#define _CVDTXEN1B_TX2_9_LENGTH                  0x00000001

#define _CVDRXEN0B_RX0_0_POSITION                0x00000000
#define _CVDRXEN0B_RX0_0_MASK                    0x00000001
#define _CVDRXEN0B_RX0_0_LENGTH                  0x00000001

#define _CVDRXEN0B_RX1_0_POSITION                0x00000001
#define _CVDRXEN0B_RX1_0_MASK                    0x00000002
#define _CVDRXEN0B_RX1_0_LENGTH                  0x00000001

#define _CVDRXEN0B_RX2_0_POSITION                0x00000002
#define _CVDRXEN0B_RX2_0_MASK                    0x00000004
#define _CVDRXEN0B_RX2_0_LENGTH                  0x00000001

#define _CVDRXEN0B_RX3_0_POSITION                0x00000003
#define _CVDRXEN0B_RX3_0_MASK                    0x00000008
#define _CVDRXEN0B_RX3_0_LENGTH                  0x00000001

#define _CVDRXEN0B_RX4_0_POSITION                0x00000004
#define _CVDRXEN0B_RX4_0_MASK                    0x00000010
#define _CVDRXEN0B_RX4_0_LENGTH                  0x00000001

#define _CVDRXEN0B_RX0_1_POSITION                0x00000005
#define _CVDRXEN0B_RX0_1_MASK                    0x00000020
#define _CVDRXEN0B_RX0_1_LENGTH                  0x00000001

