codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128h.h
#define _CH0CON_GRXBIASEN_POSITION               0x00000011
#define _CH0CON_GRXBIASEN_MASK                   0x00020000
#define _CH0CON_GRXBIASEN_LENGTH                 0x00000001

#define _CH0CON_BUFSEL_POSITION                  0x00000012
#define _CH0CON_BUFSEL_MASK                      0x00040000
#define _CH0CON_BUFSEL_LENGTH                    0x00000001

#define _CH0CON_FILTRST_POSITION                 0x00000014
#define _CH0CON_FILTRST_MASK                     0x00100000
#define _CH0CON_FILTRST_LENGTH                   0x00000001

#define _CH0CON_AUTOFRST_POSITION                0x00000015
#define _CH0CON_AUTOFRST_MASK                    0x00200000
#define _CH0CON_AUTOFRST_LENGTH                  0x00000001

#define _CH0CON_BUFEN_POSITION                   0x00000018
#define _CH0CON_BUFEN_MASK                       0x01000000
#define _CH0CON_BUFEN_LENGTH                     0x00000001

#define _CH0CON_RXFILTEN_POSITION                0x00000019
#define _CH0CON_RXFILTEN_MASK                    0x02000000
#define _CH0CON_RXFILTEN_LENGTH                  0x00000001

#define _CH0CON_REFATTEN_POSITION                0x0000001B
#define _CH0CON_REFATTEN_MASK                    0x08000000
#define _CH0CON_REFATTEN_LENGTH                  0x00000001

#define _CH0CON_REFFILTEN_POSITION               0x0000001C
#define _CH0CON_REFFILTEN_MASK                   0x10000000
#define _CH0CON_REFFILTEN_LENGTH                 0x00000001

#define _CH0CON_DIFFEN_POSITION                  0x0000001E
#define _CH0CON_DIFFEN_MASK                      0x40000000
#define _CH0CON_DIFFEN_LENGTH                    0x00000001

#define _CH1CON_DIFFGAIN_POSITION                0x00000000
#define _CH1CON_DIFFGAIN_MASK                    0x00000003
#define _CH1CON_DIFFGAIN_LENGTH                  0x00000002

#define _CH1CON_LPFILTSEL_POSITION               0x00000004
#define _CH1CON_LPFILTSEL_MASK                   0x000000F0
#define _CH1CON_LPFILTSEL_LENGTH                 0x00000004

#define _CH1CON_CVDEN_POSITION                   0x00000008
#define _CH1CON_CVDEN_MASK                       0x00000100
#define _CH1CON_CVDEN_LENGTH                     0x00000001

#define _CH1CON_CHPRE_POSITION                   0x00000009
#define _CH1CON_CHPRE_MASK                       0x00000200
#define _CH1CON_CHPRE_LENGTH                     0x00000001

#define _CH1CON_BIASEN_POSITION                  0x0000000A
#define _CH1CON_BIASEN_MASK                      0x00000400
#define _CH1CON_BIASEN_LENGTH                    0x00000001

#define _CH1CON_POLINV_POSITION                  0x0000000B
#define _CH1CON_POLINV_MASK                      0x00000800
#define _CH1CON_POLINV_LENGTH                    0x00000001

#define _CH1CON_DCAPSEL_POSITION                 0x0000000C
#define _CH1CON_DCAPSEL_MASK                     0x00003000
#define _CH1CON_DCAPSEL_LENGTH                   0x00000002

#define _CH1CON_DCAPPWR_POSITION                 0x0000000F
#define _CH1CON_DCAPPWR_MASK                     0x00008000
#define _CH1CON_DCAPPWR_LENGTH                   0x00000001

#define _CH1CON_GRXPRE_POSITION                  0x00000010
#define _CH1CON_GRXPRE_MASK                      0x00010000
#define _CH1CON_GRXPRE_LENGTH                    0x00000001

#define _CH1CON_GRXBIASEN_POSITION               0x00000011
#define _CH1CON_GRXBIASEN_MASK                   0x00020000
#define _CH1CON_GRXBIASEN_LENGTH                 0x00000001

#define _CH1CON_BUFSEL_POSITION                  0x00000012
#define _CH1CON_BUFSEL_MASK                      0x00040000
#define _CH1CON_BUFSEL_LENGTH                    0x00000001

#define _CH1CON_FILTRST_POSITION                 0x00000014
#define _CH1CON_FILTRST_MASK                     0x00100000
#define _CH1CON_FILTRST_LENGTH                   0x00000001

#define _CH1CON_AUTOFRST_POSITION                0x00000015
#define _CH1CON_AUTOFRST_MASK                    0x00200000
#define _CH1CON_AUTOFRST_LENGTH                  0x00000001

#define _CH1CON_BUFEN_POSITION                   0x00000018
#define _CH1CON_BUFEN_MASK                       0x01000000
#define _CH1CON_BUFEN_LENGTH                     0x00000001

#define _CH1CON_RXFILTEN_POSITION                0x00000019
#define _CH1CON_RXFILTEN_MASK                    0x02000000
#define _CH1CON_RXFILTEN_LENGTH                  0x00000001

#define _CH1CON_REFATTEN_POSITION                0x0000001B
#define _CH1CON_REFATTEN_MASK                    0x08000000
#define _CH1CON_REFATTEN_LENGTH                  0x00000001

#define _CH1CON_REFFILTEN_POSITION               0x0000001C
#define _CH1CON_REFFILTEN_MASK                   0x10000000
#define _CH1CON_REFFILTEN_LENGTH                 0x00000001

#define _CH1CON_DIFFEN_POSITION                  0x0000001E
#define _CH1CON_DIFFEN_MASK                      0x40000000
#define _CH1CON_DIFFEN_LENGTH                    0x00000001

#define _CH2CON_DIFFGAIN_POSITION                0x00000000
#define _CH2CON_DIFFGAIN_MASK                    0x00000003
#define _CH2CON_DIFFGAIN_LENGTH                  0x00000002

#define _CH2CON_LPFILTSEL_POSITION               0x00000004
#define _CH2CON_LPFILTSEL_MASK                   0x000000F0
#define _CH2CON_LPFILTSEL_LENGTH                 0x00000004

#define _CH2CON_CVDEN_POSITION                   0x00000008
#define _CH2CON_CVDEN_MASK                       0x00000100
#define _CH2CON_CVDEN_LENGTH                     0x00000001

#define _CH2CON_CHPRE_POSITION                   0x00000009
#define _CH2CON_CHPRE_MASK                       0x00000200
#define _CH2CON_CHPRE_LENGTH                     0x00000001

#define _CH2CON_BIASEN_POSITION                  0x0000000A
#define _CH2CON_BIASEN_MASK                      0x00000400
#define _CH2CON_BIASEN_LENGTH                    0x00000001

#define _CH2CON_POLINV_POSITION                  0x0000000B
#define _CH2CON_POLINV_MASK                      0x00000800
#define _CH2CON_POLINV_LENGTH                    0x00000001

#define _CH2CON_DCAPSEL_POSITION                 0x0000000C
#define _CH2CON_DCAPSEL_MASK                     0x00003000
#define _CH2CON_DCAPSEL_LENGTH                   0x00000002

#define _CH2CON_DCAPPWR_POSITION                 0x0000000F
#define _CH2CON_DCAPPWR_MASK                     0x00008000
#define _CH2CON_DCAPPWR_LENGTH                   0x00000001

#define _CH2CON_GRXPRE_POSITION                  0x00000010
#define _CH2CON_GRXPRE_MASK                      0x00010000
#define _CH2CON_GRXPRE_LENGTH                    0x00000001

