codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128h.h
#define _AD4CON1_SAMCV_POSITION                  0x00000018
#define _AD4CON1_SAMCV_MASK                      0x1F000000
#define _AD4CON1_SAMCV_LENGTH                    0x00000005

#define _ADC0RESR_ADRES_POSITION                 0x00000000
#define _ADC0RESR_ADRES_MASK                     0xFFFFFFFF
#define _ADC0RESR_ADRES_LENGTH                   0x00000020

#define _ADC1RESR_ADRES_POSITION                 0x00000000
#define _ADC1RESR_ADRES_MASK                     0xFFFFFFFF
#define _ADC1RESR_ADRES_LENGTH                   0x00000020

#define _ADC2RESR_ADRES_POSITION                 0x00000000
#define _ADC2RESR_ADRES_MASK                     0xFFFFFFFF
#define _ADC2RESR_ADRES_LENGTH                   0x00000020

#define _ADC3RESR_ADRES_POSITION                 0x00000000
#define _ADC3RESR_ADRES_MASK                     0xFFFFFFFF
#define _ADC3RESR_ADRES_LENGTH                   0x00000020

#define _ADC4RESR_ADRES_POSITION                 0x00000000
#define _ADC4RESR_ADRES_MASK                     0xFFFFFFFF
#define _ADC4RESR_ADRES_LENGTH                   0x00000020

#define _ADCOMCHS_AD0CHS_POSITION                0x00000000
#define _ADCOMCHS_AD0CHS_MASK                    0x00000003
#define _ADCOMCHS_AD0CHS_LENGTH                  0x00000002

#define _ADCOMCHS_AD1CHS_POSITION                0x00000004
#define _ADCOMCHS_AD1CHS_MASK                    0x00000030
#define _ADCOMCHS_AD1CHS_LENGTH                  0x00000002

#define _ADCOMCHS_AD2CHS_POSITION                0x00000008
#define _ADCOMCHS_AD2CHS_MASK                    0x00000300
#define _ADCOMCHS_AD2CHS_LENGTH                  0x00000002

#define _ADCOMCHS_AD3CHS_POSITION                0x0000000C
#define _ADCOMCHS_AD3CHS_MASK                    0x00003000
#define _ADCOMCHS_AD3CHS_LENGTH                  0x00000002

#define _ADCOMCHS_AD4CHS_POSITION                0x00000010
#define _ADCOMCHS_AD4CHS_MASK                    0x00030000
#define _ADCOMCHS_AD4CHS_LENGTH                  0x00000002

#define _CICCON_SHIFT_POSITION                   0x00000000
#define _CICCON_SHIFT_MASK                       0x0000001F
#define _CICCON_SHIFT_LENGTH                     0x00000005

#define _CICCON_ORDER_POSITION                   0x00000008
#define _CICCON_ORDER_MASK                       0x00000100
#define _CICCON_ORDER_LENGTH                     0x00000001

#define _CICCON_MODE_POSITION                    0x0000000B
#define _CICCON_MODE_MASK                        0x00000800
#define _CICCON_MODE_LENGTH                      0x00000001

#define _CICCON_SIDL_POSITION                    0x0000000D
#define _CICCON_SIDL_MASK                        0x00002000
#define _CICCON_SIDL_LENGTH                      0x00000001

#define _CICCON_FRZ_POSITION                     0x0000000E
#define _CICCON_FRZ_MASK                         0x00004000
#define _CICCON_FRZ_LENGTH                       0x00000001

#define _CICCON_ON_POSITION                      0x0000000F
#define _CICCON_ON_MASK                          0x00008000
#define _CICCON_ON_LENGTH                        0x00000001

#define _CICCON_EN_POSITION                      0x00000010
#define _CICCON_EN_MASK                          0x001F0000
#define _CICCON_EN_LENGTH                        0x00000005

#define _CICCON_DLEN_POSITION                    0x00000018
#define _CICCON_DLEN_MASK                        0x01000000
#define _CICCON_DLEN_LENGTH                      0x00000001

#define _CICCON_DINT_POSITION                    0x00000019
#define _CICCON_DINT_MASK                        0x02000000
#define _CICCON_DINT_LENGTH                      0x00000001

#define _CICCON_DMAEN_POSITION                   0x0000001A
#define _CICCON_DMAEN_MASK                       0x04000000
#define _CICCON_DMAEN_LENGTH                     0x00000001

#define _CICCON_RESET_POSITION                   0x0000001B
#define _CICCON_RESET_MASK                       0x08000000
#define _CICCON_RESET_LENGTH                     0x00000001

#define _CICCON_UPDATE_POSITION                  0x0000001C
#define _CICCON_UPDATE_MASK                      0x10000000
#define _CICCON_UPDATE_LENGTH                    0x00000001

#define _CICCON_DEMODEN_POSITION                 0x0000001D
#define _CICCON_DEMODEN_MASK                     0x20000000
#define _CICCON_DEMODEN_LENGTH                   0x00000001

#define _CICCON_POLS_POSITION                    0x0000001E
#define _CICCON_POLS_MASK                        0x40000000
#define _CICCON_POLS_LENGTH                      0x00000001

#define _CICCON_SOURCE_POSITION                  0x0000001F
#define _CICCON_SOURCE_MASK                      0x80000000
#define _CICCON_SOURCE_LENGTH                    0x00000001

#define _CICLEN_LEN1_POSITION                    0x00000000
#define _CICLEN_LEN1_MASK                        0x00000FFF
#define _CICLEN_LEN1_LENGTH                      0x0000000C

#define _CICLEN_LEN2_POSITION                    0x00000010
#define _CICLEN_LEN2_MASK                        0x0FFF0000
#define _CICLEN_LEN2_LENGTH                      0x0000000C

#define _FISCON_TLOW_POSITION                    0x00000000
#define _FISCON_TLOW_MASK                        0x0000FFFF
#define _FISCON_TLOW_LENGTH                      0x00000010

#define _FISCON_THIGH_POSITION                   0x00000010
#define _FISCON_THIGH_MASK                       0xFFFF0000
#define _FISCON_THIGH_LENGTH                     0x00000010

#define _CICIN0_CICIN_POSITION                   0x00000000
#define _CICIN0_CICIN_MASK                       0x0000FFFF
#define _CICIN0_CICIN_LENGTH                     0x00000010

#define _CICIN1_CICIN_POSITION                   0x00000000
#define _CICIN1_CICIN_MASK                       0x0000FFFF
#define _CICIN1_CICIN_LENGTH                     0x00000010

#define _CICIN2_CICIN_POSITION                   0x00000000
#define _CICIN2_CICIN_MASK                       0x0000FFFF
#define _CICIN2_CICIN_LENGTH                     0x00000010

#define _CICIN3_CICIN_POSITION                   0x00000000
#define _CICIN3_CICIN_MASK                       0x0000FFFF
#define _CICIN3_CICIN_LENGTH                     0x00000010

#define _CICIN4_CICIN_POSITION                   0x00000000
#define _CICIN4_CICIN_MASK                       0x0000FFFF
#define _CICIN4_CICIN_LENGTH                     0x00000010

#define _CICSTAT_COUNT_POSITION                  0x00000000
#define _CICSTAT_COUNT_MASK                      0x00000FFF
#define _CICSTAT_COUNT_LENGTH                    0x0000000C

