codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128h.h
#define _IOCPDB_IOCPDB9_POSITION                 0x00000009
#define _IOCPDB_IOCPDB9_MASK                     0x00000200
#define _IOCPDB_IOCPDB9_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB10_POSITION                0x0000000A
#define _IOCPDB_IOCPDB10_MASK                    0x00000400
#define _IOCPDB_IOCPDB10_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB11_POSITION                0x0000000B
#define _IOCPDB_IOCPDB11_MASK                    0x00000800
#define _IOCPDB_IOCPDB11_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB13_POSITION                0x0000000D
#define _IOCPDB_IOCPDB13_MASK                    0x00002000
#define _IOCPDB_IOCPDB13_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB14_POSITION                0x0000000E
#define _IOCPDB_IOCPDB14_MASK                    0x00004000
#define _IOCPDB_IOCPDB14_LENGTH                  0x00000001

#define _IOCPDB_IOCPDB15_POSITION                0x0000000F
#define _IOCPDB_IOCPDB15_MASK                    0x00008000
#define _IOCPDB_IOCPDB15_LENGTH                  0x00000001

#define _IOCPDB_w_POSITION                       0x00000000
#define _IOCPDB_w_MASK                           0xFFFFFFFF
#define _IOCPDB_w_LENGTH                         0x00000020

#define _IOCCONB_SIDL_POSITION                   0x0000000D
#define _IOCCONB_SIDL_MASK                       0x00002000
#define _IOCCONB_SIDL_LENGTH                     0x00000001

#define _IOCCONB_ON_POSITION                     0x0000000F
#define _IOCCONB_ON_MASK                         0x00008000
#define _IOCCONB_ON_LENGTH                       0x00000001

#define _IOCCONB_w_POSITION                      0x00000000
#define _IOCCONB_w_MASK                          0xFFFFFFFF
#define _IOCCONB_w_LENGTH                        0x00000020

#define _IOCIEB_IOCIEB0_POSITION                 0x00000000
#define _IOCIEB_IOCIEB0_MASK                     0x00000001
#define _IOCIEB_IOCIEB0_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB1_POSITION                 0x00000001
#define _IOCIEB_IOCIEB1_MASK                     0x00000002
#define _IOCIEB_IOCIEB1_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB2_POSITION                 0x00000002
#define _IOCIEB_IOCIEB2_MASK                     0x00000004
#define _IOCIEB_IOCIEB2_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB3_POSITION                 0x00000003
#define _IOCIEB_IOCIEB3_MASK                     0x00000008
#define _IOCIEB_IOCIEB3_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB4_POSITION                 0x00000004
#define _IOCIEB_IOCIEB4_MASK                     0x00000010
#define _IOCIEB_IOCIEB4_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB5_POSITION                 0x00000005
#define _IOCIEB_IOCIEB5_MASK                     0x00000020
#define _IOCIEB_IOCIEB5_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB7_POSITION                 0x00000007
#define _IOCIEB_IOCIEB7_MASK                     0x00000080
#define _IOCIEB_IOCIEB7_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB8_POSITION                 0x00000008
#define _IOCIEB_IOCIEB8_MASK                     0x00000100
#define _IOCIEB_IOCIEB8_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB9_POSITION                 0x00000009
#define _IOCIEB_IOCIEB9_MASK                     0x00000200
#define _IOCIEB_IOCIEB9_LENGTH                   0x00000001

#define _IOCIEB_IOCIEB10_POSITION                0x0000000A
#define _IOCIEB_IOCIEB10_MASK                    0x00000400
#define _IOCIEB_IOCIEB10_LENGTH                  0x00000001

#define _IOCIEB_IOCIEB11_POSITION                0x0000000B
#define _IOCIEB_IOCIEB11_MASK                    0x00000800
#define _IOCIEB_IOCIEB11_LENGTH                  0x00000001

#define _IOCIEB_IOCIEB13_POSITION                0x0000000D
#define _IOCIEB_IOCIEB13_MASK                    0x00002000
#define _IOCIEB_IOCIEB13_LENGTH                  0x00000001

#define _IOCIEB_IOCIEB14_POSITION                0x0000000E
#define _IOCIEB_IOCIEB14_MASK                    0x00004000
#define _IOCIEB_IOCIEB14_LENGTH                  0x00000001

#define _IOCIEB_IOCIEB15_POSITION                0x0000000F
#define _IOCIEB_IOCIEB15_MASK                    0x00008000
#define _IOCIEB_IOCIEB15_LENGTH                  0x00000001

#define _IOCIEB_w_POSITION                       0x00000000
#define _IOCIEB_w_MASK                           0xFFFFFFFF
#define _IOCIEB_w_LENGTH                         0x00000020

#define _IOCIFB_IOCIFB0_POSITION                 0x00000000
#define _IOCIFB_IOCIFB0_MASK                     0x00000001
#define _IOCIFB_IOCIFB0_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB1_POSITION                 0x00000001
#define _IOCIFB_IOCIFB1_MASK                     0x00000002
#define _IOCIFB_IOCIFB1_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB2_POSITION                 0x00000002
#define _IOCIFB_IOCIFB2_MASK                     0x00000004
#define _IOCIFB_IOCIFB2_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB3_POSITION                 0x00000003
#define _IOCIFB_IOCIFB3_MASK                     0x00000008
#define _IOCIFB_IOCIFB3_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB4_POSITION                 0x00000004
#define _IOCIFB_IOCIFB4_MASK                     0x00000010
#define _IOCIFB_IOCIFB4_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB5_POSITION                 0x00000005
#define _IOCIFB_IOCIFB5_MASK                     0x00000020
#define _IOCIFB_IOCIFB5_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB7_POSITION                 0x00000007
#define _IOCIFB_IOCIFB7_MASK                     0x00000080
#define _IOCIFB_IOCIFB7_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB8_POSITION                 0x00000008
#define _IOCIFB_IOCIFB8_MASK                     0x00000100
#define _IOCIFB_IOCIFB8_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB9_POSITION                 0x00000009
#define _IOCIFB_IOCIFB9_MASK                     0x00000200
#define _IOCIFB_IOCIFB9_LENGTH                   0x00000001

#define _IOCIFB_IOCIFB10_POSITION                0x0000000A
#define _IOCIFB_IOCIFB10_MASK                    0x00000400
#define _IOCIFB_IOCIFB10_LENGTH                  0x00000001

#define _IOCIFB_IOCIFB11_POSITION                0x0000000B
#define _IOCIFB_IOCIFB11_MASK                    0x00000800
#define _IOCIFB_IOCIFB11_LENGTH                  0x00000001

